[
	{
		"title": "Journal",
		"date": "06-07-2017 17:00",
		"text": "I've started keeping a <a href=\"http://journal.skorulis.com\">daily journal</a> of the various things I'm doing. Mostly for personal reflection."
	},
	{
		"title": "Easy Money",
		"date": "22-09-2016 18:00",
		"text": "I've been spending some time researching ways to make money online. So far I haven't cracked the code but have <a href=\"http://money.skorulis.com/sites.html\">reviewed many potential sites</a>. Hopefully this helps someone."
	},
	{
		"title": "975 Beers",
		"date": "21-09-2016 20:00",
		"text": "Did an update to my <a href=\"beer/index.html\">big album of beers</a>. Now up to 975 beers which leaves me only 25 beers left this year to reach my goal. What will be #1000?"
	},
	{
		"title": "Positly",
		"date": "21-09-2016 17:00",
		"text": "Positly is all about tracking opinions. It's not about being right or wrong but getting an understanding of what different people believe and think. With this data users can see how well their views line up with the majority as well as gain an understanding of how opinions relate to each other. "
	},
	{
		"title": "Unreal Engine 4",
		"date": "27-03-2014 21:00",
		"text": "Started some experimentation with the new <a href=\"https://www.unrealengine.com\">unreal engine 4</a> and spent some time with the level editor trying to create some basic geometry <a href=\"http://blog.skorulis.com/2014/03/unreal-engine-4-creating-a-triangle-block/\">blog post here</a>"
	},
	{
		"title": "Project Drone: Day 3",
		"date": "19-03-2014 12:45",
		"text": "Posted <a href=\"http://blog.skorulis.com/2014/03/project-drone-day-3/\">day 3</a> in my series on creating a game in libGDX."
	},
	{
		"title": "The Big Album of Beers",
		"date": "26-10-2013 17:40",
		"text": "Just finished my initial version of the <a href=\"beer\">Big Album of Beers</a>. For more information see the <a href=\"http://blog.skorulis.com/2013/10/the-big-album-of-beers\">blog post</a> about it."
	},
	{
		"title": "Yet another trendy library",
		"date": "23-10-2013 21:20",
		"text": "On top of Ember.js I've decided to use <a href=\"http://getbootstrap.com/\">Bootstrap</a>. Since I'm primarily a mobile dev it seems that my website should work correctly on a mobile device. Also my web skills aren't that great and it gives me a good starting point."
	},
	{
		"title": "Moving to EC2",
		"date": "23-10-2013 20:14",
		"text": "In addition to a completely redesigning the site I'm also moving to a new hosting provider. I've been meaning to get familiar with <a href=\"http://aws.amazon.com/ec2/\">Amazon's EC2</a> for a while so I've decided to try and use a micro instance there. You can get this free for a year as long as your usage isn't too high"
	},
	
	{
		"title": "A new start for skorulis.com",
		"date": "23-10-2013 18:42",
		"text": "Work continues on recreating skorulis.com from scratch. I've decided on a new approach (for me) building the website using <a href=\"http://emberjs.com/\">Ember.js</a>. The whole site is small enough right now that I can get away just building all the data sources directly into the code. I'll change this to use an API later on."
	}
]
